In [1]:
dataset_id = "bollywood_modeled"
!bq --location=US mk --dataset {dataset_id}

Dataset 'starry-center-266501:bollywood_modeled' successfully created.

In [49]:
%%bigquery
CREATE TABLE bollywood_modeled.bollywoodTitles 
AS
SELECT DISTINCT Title title, Release_Month MMM, CAST(Release_Date AS INT64) AS DD, Year YYYY, CAST(Highest_Grosser_By_Year_in_crores_ AS NUMERIC) croresGrossed
FROM bollywood_staging.bollywood

Empty DataFrame
Columns: []
Index: []

## Sample bollywoodTitles

In [51]:
%%bigquery
SELECT * 
FROM bollywood_modeled.bollywoodTitles
WHERE MMM != 'None'
AND croresGrossed IS NOT NULL

                title  MMM  DD  YYYY   croresGrossed
0             Dabangg  SEP  10  2010   250.000000000
1        Ek Tha Tiger  AUG  15  2012   334.390000000
2                  PK  DEC  19  2014   832.000000000
3             Dhoom 3  DEC  20  2013   589.200000000
4     Tiger Zinda Hai  DEC  22  2017   565.100000000
5              Dangal  DEC  23  2016  2024.000000000
6   Bajrangi Bhaijaan  JUL  24  2015   969.060000000
7            3 Idiots  DEC  25  2009   459.960000000
8             Ghajini  DEC  26  2008   232.000000000
9               Sanju  JUN  29  2018   586.860000000
10          Bodyguard  AUG  31  2011   234.390000000

In [52]:
%%bigquery
SELECT COUNT(*)
FROM bollywood_modeled.bollywoodTitles

    f0_
0  9660

In [53]:
%%bigquery
SELECT DISTINCT COUNT(title)
FROM bollywood_modeled.bollywoodTitles

    f0_
0  9660

## Title is the PK for this table

In [44]:
%%bigquery
CREATE TABLE bollywood_modeled.bollywoodDirects
AS
SELECT DISTINCT Director director, Title title
FROM bollywood_staging.bollywood

Empty DataFrame
Columns: []
Index: []

In [46]:
%%bigquery
SELECT *
FROM bollywood_modeled.bollywoodDirects
LIMIT 5

  director            title
0      Jal            Dr. Z
1     Anay   Happy Husbands
2     Baby  Bhayaanak Mahal
3     Baby     House No. 13
4     Bapu       Paramaatma

In [48]:
%%bigquery
SELECT COUNT(*)
FROM bollywood_modeled.bollywoodDirects

    f0_
0  9613

In [54]:
%%bigquery
SELECT COUNT (*)
FROM
  (SELECT DISTINCT director, title
  FROM bollywood_modeled.bollywoodDirects)

    f0_
0  9613

## Director and title make up a composite primary key

In [56]:
%%bigquery
SELECT d.title 
FROM bollywood_modeled.bollywoodDirects d
WHERE d.title NOT IN
  (SELECT DISTINCT t.title 
   FROM bollywood_modeled.bollywoodTitles t)

Empty DataFrame
Columns: [title]
Index: []

## Referential integrity is maintained between parent table bollywoodTitles and child table bollywoodDirects on the title field

In [62]:
%%bigquery
CREATE TABLE bollywood_modeled.bollywoodGenres
AS
SELECT DISTINCT Title title, Genre genre
FROM bollywood_staging.bollywood
WHERE genre != 'None'

Empty DataFrame
Columns: []
Index: []

In [63]:
%%bigquery
SELECT * 
FROM bollywood_modeled.bollywoodGenres
LIMIT 5

               title genre
0           Haqeeqat   war
1             Border   war
2               1971   war
3   Param Vir Chakra   war
4  Yeh Saali Zindagi  cult

In [64]:
%%bigquery
SELECT COUNT (*)
FROM bollywood_modeled.bollywoodGenres

    f0_
0  9449

In [65]:
%%bigquery
SELECT DISTINCT COUNT(title)
FROM bollywood_modeled.bollywoodGenres

    f0_
0  9449

## title is a PK for bollywoodGenres

In [69]:
%%bigquery
SELECT g.title
FROM bollywood_modeled.bollywoodGenres g
WHERE g.title NOT IN
  (SELECT t.title
   FROM bollywood_modeled.bollywoodTitles t)

Empty DataFrame
Columns: [title]
Index: []

## The referential integrity between parent table bollywoodTitles and child table bollywoodGenres is maintained on field title

In [24]:
%%bigquery
CREATE TABLE bollywood_modeled.bollywoodCast 
AS
SELECT Title title, b.Cast cast_
FROM bollywood_staging.bollywood b
WHERE b.Cast != "unknown"

Empty DataFrame
Columns: []
Index: []

In [27]:
%%bigquery
SELECT * 
FROM bollywood_modeled.bollywoodCast
LIMIT 5

  title                                              cast_
0     D          randeep,chunky,koppikar,isha,pandey,hooda
1     W  sonal,danish,giani,pandor,leslie,meer,abhey,al...
2     X                          kapoor,qureshi,huma,rajat
3    3G                    sonal,neil,chauhan,nitin,mukesh
4    99  vinod,khan,soha,khemu,ali,boman,simone,khanna,...

In [28]:
%%bigquery
SELECT COUNT (*)
FROM bollywood_modeled.bollywoodCast

    f0_
0  8989

In [29]:
%%bigquery
SELECT DISTINCT COUNT(title)
FROM bollywood_modeled.bollywoodCast

    f0_
0  8989

## Title is verified as a primary key for the table

In [30]:
%%bigquery
SELECT title 
FROM bollywood_modeled.bollywoodCast c
WHERE c.title NOT IN
  (SELECT title 
   FROM bollywood_modeled.bollywoodTitles)

Empty DataFrame
Columns: [title]
Index: []

## Referential integrity is maintained between parent table "bollywoodTitles" and child table "bollywoodCast" on field "title"

In [65]:
%%bigquery
SELECT primaryTitle, startYear
FROM imdb_modeled.title_Beam_DF 
JOIN bollywood_modeled.bollywoodTitles 
ON title = primaryTitle 
AND startYear = YYYY

           primaryTitle  startYear
0                  Jurm       2005
1          Bhule Bhatke       1952
2               Dayavan       1988
3       Don Muthu Swami       2008
4     Phir Bhi Apna Hai       1946
...                 ...        ...
6177       Meena Bazaar       1950
6178        Hamari Beti       1950
6179          Rock On!!       2008
6180     Bhakta Prahlad       1932
6181             Leader       1964

[6182 rows x 2 columns]

In [74]:
%%bigquery
CREATE TABLE bollywood_modeled.bollywoodActs
AS
SELECT Name actor, Height_in_cm_ height_cm, "actress" AS job 
FROM bollywood_staging.bollywoodActress
UNION ALL
SELECT Name actor, Height_in_cm_ height_cm, "actor" AS job 
FROM bollywood_staging.bollywoodActors

Empty DataFrame
Columns: []
Index: []

In [75]:
%%bigquery
SELECT *
FROM bollywood_modeled.bollywoodActs
LIMIT 5

              actor  height_cm    job
0        Aamir Khan        163  actor
1  Himesh Reshamiya        163  actor
2      Kamal Haasan        165  actor
3       Kunal Khemu        166  actor
4     Shahid Kapoor        167  actor

In [76]:
%%bigquery
SELECT COUNT(*)
FROM bollywood_modeled.bollywoodActs

   f0_
0  273

In [77]:
%%bigquery
SELECT DISTINCT COUNT(actor)
FROM bollywood_modeled.bollywoodActs

   f0_
0  273

## Actor is a primary key